//
// Created by Кирило Вєтров on 07.08.2026.
//

#include <iostream>

using namespace std;

int main() {
#include <array>

    // відповідно до норм MISRA C++
    //
    // constexpr std::size_t MAP_ROWS = 9U;
    // constexpr std::size_t MAP_COLS = 13U;
    //
    // constexpr std::array<std::array<char, MAP_COLS>, MAP_ROWS> map = {{
    //     {'#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#'},
    //     {'#', 'P', '.', '.', '.', '.', '#', '.', '.', '.', '.', '.', '#'},
    //     {'#', '.', '#', '#', '.', '.', '#', '.', '.', '#', '#', '.', '#'},
    //     {'#', '.', '.', '.', '.', '#', '#', '.', '.', '.', '.', '.', '#'},
    //     {'#', '#', '#', '.', '.', '.', '.', '.', '#', '#', '#', '.', '#'},
    //     {'#', '.', '.', '.', '#', '#', '.', '.', '.', '.', '.', '.', '#'},
    //     {'#', '.', '.', '$', '.', '.', '.', '.', '#', '.', '.', '.', '#'},
    //     {'#', '.', '#', '#', '#', '#', '.', '.', '#', '.', '#', 'E', '#'},
    //     {'#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#'}
    // }};

    vector <vector<char>> map {
        {
            {'#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#'},
            {'#', 'P', '.', '.', '.', '.', '#', '.', '.', '.', '.', '.', '#'},
            {'#', '.', '#', '#', '.', '.', '#', '.', '.', '#', '#', '.', '#'},
            {'#', '.', '.', '.', '.', '#', '#', '.', '.', '.', '.', '.', '#'},
            {'#', '#', '#', '.', '.', '.', '.', '.', '#', '#', '#', '.', '#'},
            {'#', '.', '.', '.', '#', '#', '.', '.', '.', '.', '.', '.', '#'},
            {'#', '.', '.', '$', '.', '.', '.', '.', '#', '.', '.', '.', '#'},
            {'#', '.', '#', '#', '#', '#', '.', '.', '#', '.', '#', 'E', '#'},
            {'#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#'}
        }
    };

    // Виведення динамічного масиву типу матриця
    for (int i = 0; i < map.size(); i++) {
        for (int j = 0; j < map[i].size(); j++) {
            cout << map[i][j] << " ";
        }
        cout << endl;
    }

    // Переміщення гравця P
    char control;
    while (cin >> control) {
        switch (control) {
            // up
            case 'w':
                cout << 'w';
                break;

            // left
            case 'a':
                cout << 'a';
                break;

            // down
            case 's':
                cout << 's';
                break;

            // right
            case 'd':
                bool flag = false;

                for (int i = 0; i < map.size(); i++) {
                    for (int j = 0; j < map[i].size(); j++) {
                        if (!flag) {
                            if (map[i][j] == 'P') {
                                // Координати знайдено: i та j
                                map[i][j+1] = 'P';
                                map[i][j] = '.';
                                //int new_i = i + 1;
                                // int new_j = j + 1;
                                //map[new_i][j] = 'P';
                                flag = true;
                            }
                        }
                        cout << map[i][j] << " ";
                    }
                    cout << endl;
                }
                //cout << 'd';
                break;

            //case 9: return 0;
            //default: cout << "Введіть правильний пункт: \n"; break;
        }

    }

    return 0;
}