//
// Created by Кирило Вєтров on 12.08.2026.
// Menu for games
#include <iostream>

using namespace std;

int main() {

    // ----------------------------------------------------------------------------
    // Можливі варіанти кольорів для відображення тексту
    // ----------------------------------------------------------------------------
    constexpr auto black  = "\033[30m";                                     // чорний
    constexpr auto red    = "\033[31m";                                     // червоний
    constexpr auto green  = "\033[32m";                                     // зелений
    constexpr auto yellow = "\033[33m";                                     // жовтий
    constexpr auto blue   = "\033[34m";                                     // синій
    constexpr auto purple = "\033[35m";                                     // пурпуровий
    constexpr auto cyan   = "\033[36m";                                     // блакитний
    constexpr auto white  = "\033[37m";                                     // білий
    // ============================================================================


    // ----------------------------------------------------------------------------
    // Якщо забрати 'U', то за стандартом MISRA буде попередження '176'
    // знакове число, а ми явно вказуємо на беззнаковість size_t
    constexpr size_t width = 176U;                                          // стандартна ширина терміналу
    //constexpr size_t height = 0;
    constexpr size_t map_rows = 9U;                                         // за замовчуванням колонки масиву поля
    constexpr size_t map_cols = 13U;                                        // за замовчуванням рядки масиву поля

    constexpr auto DIS_MAP = '\t';                                          // відстань між ходами поля гри
    // ============================================================================

    size_t COUNT_C = ((width / 2U) - (map_rows * 3U));                      // розрахунок центру для масиву поля

    // ----------------------------------------------------------------------------
    vector <vector<char>> playingField {
        {'#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#'},
        {'#', 'P', '.', '.', '.', '.', '#', '.', '.', '.', '.', '.', '#'},
        {'#', '.', '#', '#', '.', '.', '#', '.', '.', '#', '#', '.', '#'},
        {'#', '.', '.', '.', '.', '#', '#', '.', '.', '.', '.', '.', '#'},
        {'#', '#', '#', '.', '.', '.', '.', '.', '#', '#', '#', '.', '#'},
        {'#', '.', '.', '.', '#', '#', '.', '.', '.', '.', '.', '.', '#'},
        {'#', '.', '.', '$', '.', '.', '.', '.', '#', '.', '.', '.', '#'},
        {'#', '.', '#', '#', '#', '#', '.', '.', '#', '.', '#', 'E', '#'},
        {'#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#'}
    };
    // ----------------------------------------------------------------------------

    vector<vector<char>> map(map_rows, vector<char>(map_cols));

    // statistics info games
    cout << "                                                               " << "[  .. ]                 " << '\t' << "coins: " << "10$" << '\n';
    cout << "                                                               " << "[  ... ]                " << '\t' << "steps: " << "22" << '\n';
    // rows - посилання на рядок
    // cols - посилання на окремий символ
    // standart view
    // for (auto& rows : map) {
    //     for (char& cell : rows) {
    //         cout << cell << ' ';
    //     }
    //     cout << endl;
    // }
    // view + center terminal
    // for (auto& rows : map) {
    //     // робимо відступи для центрування
    //     for (size_t i = 0; i < COUNT_C; i++) {
    //         cout << ' ';
    //     }
    //
    //     for (char& cell : rows) {
    //         cout << cell << ' ';
    //     }
    //     cout << endl;
    // }
    // end



    for (const auto& rows : playingField) {
        // робимо відступи для центрування
        for (size_t i = 0; i < COUNT_C; i++) {
            cout << ' ';
        }
        for (const auto& cells : rows) {
            cout << cells << DIS_MAP;
        }
        cout << '\n';
    }


    return 0;
}