//
// Created by Кирило Вєтров on 05.08.2026.
// Task Manager
// Використовуємо динамічні масиви даних
//
#include <iostream>

using namespace std;

// Структура для менеджера завдань
struct TaskManager {
    string title {};                                                    // за замовчуванню - ""
    bool isDone {false};                                                // за замовчуванню - false
};


int main() {

    // 1. Ініціалізуємо генератор поточним часом (робиться 1 раз на початку програми)
    srand(time(nullptr));

    string taskSearch;                                                  // для пошуку конкретної задачі
    int size = 5;                                                       // використовуємо статичний масив
    int choise = 0;                                                     // користувацька зміна

    //TaskManager tm[size];                                             // створюємо структуру TaskManager з масивів tm розміром size
    TaskManager* tm = new TaskManager[size]{};                          // динамічний масив

    // ----------------- Заповнили тестовими даними -----------------
    for (int i = 0; i < size; ++i) {
        tm[i].title = "Task " + to_string(i);
        // рандомний вибір між false та true
        tm[i].isDone = rand() % 2;
    }
    // --------------------------------------------------------------

    // Постійний масив для виведення списку задач
    while (true) {
        cout <<
            '\n' <<
            "====== TASK MANAGER ======" << '\n' <<
            "1. Показати всі задачі" << '\n' <<
            "2. Додати задачу" << '\n' <<
            "3. Видалити задачу" << '\n' <<
            "4. Позначити як виконану" << '\n' <<
            "5. Показати тільки виконані" << '\n' <<
            "6. Показати тільки невиконані" << '\n' <<
            "7. Знайти задачу" << '\n' <<
            "8. Відсортувати задачі" << '\n' <<
            "9. Вийти" << '\n' <<
            '\n' <<
            "Ваш вибір: " << '\t';
        // ----------------------------------------------------------


        // -------------------- Менеджер задач ----------------------
        cin >> choise;                                                  // очікуємо реакцію користувача, тільки int
        switch (choise) {
            // Показати всі задачі
            case 1:
                // Перегляд задач
                cout << "========= TASK ===========" << endl;
                for (int i = 0; i < size; i++) {
                    cout << tm[i].title << '\t'
                    //<< tm[i].isDone << '\n';
                    << (tm[i].isDone ? "[ Виконано ]" : "[ У процесі ]") << '\n'; // тернарний оператор (a > b) ? a : b
                }

                cout << '\n' << "Вийти до головного меню натисніть будь-яку клавішу: ";
                while (cin >> choise) {
                        break;
                    }
            break;
            // ------------------------------------------------------

            // ------------------ Додавання задач -------------------
            case 2: {
                cout << "======== ADD TASK =========" << endl;

                // Створюємо новий масив з + елементом
                TaskManager* tm_new = new TaskManager[size + 1];

                // Копіюємо старі дані
                for (int i = 0; i < size; ++i) {
                    tm_new[i] = tm[i];
                }
                // Безпечне очищення буфера перед getline замість cin.ignore(numeric_limits<streamsize>::max(), '\n');
                if (cin.peek() == '\n') {
                    cin.ignore();
                }
                // Зчитуємо назву
                cout << "Напишіть назву задачі: ";
                getline(cin, tm_new[size].title);
                // Зчитуємо статус
                cout << "Вкажіть чи виконана задача (1 - так, 0 - ні): ";
                cin >> tm_new[size].isDone;                             // якщо буде інша цифра програма зациклиться
                // Видаляємо старий масив
                delete[] tm;
                // Оновлюємо вказівник та розмір
                tm = tm_new;
                size++;

                cout << "Задачу успішно додано!\n";
                break;
            }
            // ------------------------------------------------------

            // ------------------ Видалення задач -------------------
            case 3:
                cout << "----------------------" << endl;
                cout << "Видалення задачі!" << '\n';

                // Перегляд задач
                for (int i = 0; i < size; i++) {
                    cout << i + 1 << '\t' << tm[i].title << '\t' << tm[i].isDone << '\n' ;
                }
                cout << '\n' << "Виберіть номер задачі для видалення: ";

                choise = 0;
                while (cin >> choise) {
                    // Перевіряємо чи правильно вибрали задачу
                    if (choise < size && choise > 0) {
                        tm[choise].title = "";
                        tm[choise].isDone = false;
                        cout << "Задачу під номером " << choise << " видалено" << endl;
                    }
                    else {
                        cout << "Такої задачі не існує" << endl;
                    }
                }
                break;
            // ------------------------------------------------------

            // ----------------- Редагування задач ------------------
            case 4:
                // Позначити як виконану
                cout << endl;
                // Перегляд задач
                for (int i = 0; i < size; i++) {
                    cout << i + 1 << '\t' << tm[i].title << '\t' << tm[i].isDone << '\n' ;
                }
                cout << '\n' << "Виберіть задачу для правки (введіть її номер): ";

                choise = 0;
                while (cin >> choise) {
                    if (choise < size && choise > 0) {
                        tm[choise].isDone = true;
                        cout << "Задачу під номером " << choise << " позначено як виконану" << endl;
                    }
                    else {
                        cout << "Такої задачі не існує" << endl;
                    }
                }
                break;
            // ------------------------------------------------------

            // ------------------ Виконані задачі -------------------
            case 5:
                // Показати тільки виконані задачі
                for (int i = 0; i < size; i++) {
                    if (tm[i].isDone) {
                        cout << tm[i].title << '\t' << tm[i].isDone << '\n' ;
                    }
                }
                break;
            // ------------------------------------------------------

            // ----------------- Невиконані задачі ------------------
            case 6:
                // Показати тільки невиконані задачі
                for (int i = 0; i < size; i++) {
                    if (!tm[i].isDone) {
                        cout << tm[i].title << '\t' << tm[i].isDone << '\n' ;
                    }
                }
                break;
            // ------------------------------------------------------

            // ------------------- Пошук задачі ---------------------
            case 7:
                cout << "Пошук необхідної задачі, введіть її назву: ";
                // Показати необхідну задачу
                while (getline(cin, taskSearch)) {
                    for (int i = 0; i < size; i++) {
                        if (tm[i].title == taskSearch) {
                            cout << tm[i].title << '\t' << tm[i].isDone << '\n';
                        }
                    }
                    if (taskSearch == "Exit") {
                        break;
                    }
                }
                break;
            // ------------------------------------------------------

            // ----------------- Сортування даних -------------------
            // Доопрацювати!!!
            case 8:
                // Сортування масивів
                cout << endl;
                cout << "Сортуємо за виконням" << endl;
                // //cout << "1. Відсортувати за зростанням" << endl;
                // //cout << "2. Відсортувати за зростанням" << endl;
                // for (int i = 0; i < size; i++) {
                //     if (tm[i].isDone) {
                //         tm[i].title =;
                //         tm[i].isDone =;
                //         tm[i].comments =;
                //     }
                // }
                break;
            // ------------------------------------------------------

            case 9: return 0;
            default: cout << "Введіть правильний пункт: \n"; break;
        }
    }
    //
    // delete[] tm;                                                     // правильне видалення всієї пам'яті
    // tm = nullptr;                                                    // захист від повторного використання

    return 0;
}