//
// Created by Кирило Вєтров on 11.06.2026.
//
// Завдання 3. Меню банкомату (switch + while)
// Умова: Створіть програму, яка імітує баланс рахунку (початкова сума, наприклад, 1000 грн).
// Програма має в циклі while показувати меню:
//
// Переглянути баланс
// Поповнити рахунок
// Зняти кошти
// Вихід
//
// За допомогою switch обробляйте вибір користувача. Цикл має працювати доти, доки користувач не обере пункт 4.
// При спробі зняти більше грошей, ніж є на рахунку, виводьте попередження.
#include <iostream>

int main() {
    using namespace std;
    int menu{}, balance{}, popvn{}, withdraw{};

    while (menu == 0) {

        cout << "1 - Переглянути баланс" << endl;
        cout << "2 - Поповнити рахунок" << endl;
        cout << "3 - Зняти кошти" << endl;
        cout << "4 - Вихід" << endl;

        // Очікуємо введення числа
        cout << "Введіть потрібний пункт меню: ";
        cin >> menu;

        switch (menu) {
            case 1:
                cout << "Баланс: " << balance << " грн." << endl;
                menu = 0;
                break;

            case 2:
                cout << "----- Поповнити рахунок -----" << endl;
                cout << "Введіть суму для поповнення: ";
                cin >> popvn;
                balance += popvn;
                cout << "Ваш новий баланс складає: " << balance << " грн." << endl;
                menu = 0;
                break;

            case 3:
                cout << "----- Зняти кошти -----" << endl;
                cout << "Введіть необхідну суму для зняття: ";
                cin >> withdraw;
                balance -= withdraw;
                cout << "Ваш новий баланс складає: " << balance << " грн." << endl;
                menu = 0;
                break;

            case 4:
                break;

            default:
                cout << "Некоректне введення!" << endl;
                menu = 0;
                break;
        }

    }
    return 0;
}