//
// Created by Кирило Вєтров on 10.06.2026.
//
// Завдання 1. Тернарний оператор & sizeof
// Умова: Користувач вводить ціле число.
// За допомогою тернарного оператора перевірте, чи воно парне, чи непарне, і виведіть відповідне
// повідомлення ("Парне" / "Непарне").
// Виведіть на екран, скільки байт у пам'яті займає цей тип даних за допомогою sizeof.
#include <iostream>


int main () {

    using namespace std;
    int num{};
    string res{};                                                  // int - 4 байта, а string - 24 байта

    cout << "Введіть ціле число: ";
    cin >> num;

    res = (num%2 == 0) ? "Парне число." : "Не парне число";

    cout << res << endl;
    cout << "--------------------------------------" << endl;
    cout << "Займає байт у пам'яті: " << sizeof(res) << endl;      // повертає розмір структури 24/32, а не к-сть. ел.
    cout << "Реалний розмір контейнера: " << res.size() << endl;   // реальна кількість елементів
    return 0;
}