//
// Created by Кирило Вєтров on 03.09.2026.
//
#include <iostream>
#include <chrono>                                                          // для визначення часу роботи програми/циклу


namespace {
    using std::cout;
    using std::endl;

    // Створюємо короткі псевдоніми для розрахунку часу виконання
    using Clock = std::chrono::high_resolution_clock;
    using TimePoint = std::chrono::time_point<Clock>;
    using Ms = std::chrono::duration<double, std::milli>;                  // для автоматичного переведення в мілісекунди
}

int main() {
    /*
    // ----------------------- Оголошення та ініціалізація ------------------------
    // 1. Оголошення без ініціалізації (всередині функції містить "сміття")
    int numbers[5];

    // 2. Повна ініціалізація
    int scores[5] = {10, 20, 30, 40, 50};

    // 3. Часткова ініціалізація (решта елементів стануть 0)
    int values[5] = {1, 2}; // {1, 2, 0, 0, 0}

    // 4. Zero-initialization (усі елементи = 0)
    int clean_arr[5] = {}; // {0, 0, 0, 0, 0}

    // 5. Автоматичний розмір від компілятора
    int auto_arr[] = {100, 200, 300}; // розмір буде 3
    // ============================================================================
    */

    int arr[10] = {};

    // Зчитування
    for (int val : arr) {
        std::cout << val << " ";
    }

    // // Початок заміру
    // TimePoint start = Clock::now();

    // Зміна елементів через посилання (&)
    for (int& val : arr) {
        val *= 2; // Потроює/подвоює кожен елемент
    }

    // // Кінець заміру
    // TimePoint end = Clock::now();
    // // Розрахунок часу
    // Ms duration = end - start;
    // cout << "\nЧас виконання циклу: " << duration.count() << " мс" << endl;



    // --------------------------------- Task 1 ----------------------------------
    int arr1[5] = {1,2,9,4,5};
    // ============================================================================

    // --------------------------------- Task 2 -----------------------------------
    int sum = 0;

    // Старий формат циклу for до стандарту c11, краще не використовувати для MISRA
    for (int i = 0; i < 5; i++) {
        sum += arr1[i];
    }
    // ============================================================================

    // --------------------------------- Task 3 -----------------------------------
    int max_num = 0;
    for (const int it : arr1) {
        if (it > max_num) {
            max_num = it;
        }
    }

    cout << "\nСума всіх елементів масиву: " << sum << "\nМаксимальний елемент: " << max_num << endl;
    // ============================================================================


    // ------------------------Задача: "Унікальний елемент" -----------------------
    // --------------------------Task 4. "Unique element" -------------------------
    cout << "-------------------------- Task 4 --------------------------" << endl;
    // У тебе є масив із 9 цілих чисел. Відомо, що коже число в ньому повторюється рівно двічі,
    // і лише одне число є унікальним (зустрічається тільки один раз).
    // Приклад масиву:
    // int arr[9] = {4, 1, 2, 1, 2, 8, 4, 9, 8};
    int arr2[9] = {4, 1, 2, 1, 2, 8, 4, 8, 18};
    int unique_num = 0;

    for (int i = 0; i < 9; i++) {
        int count = 0;

        for (int j = 0; j < 9; j++) {
            if (arr2[i] == arr2[j]) {
                count++;
            }
        }
        if (count == 1) {
            unique_num = arr2[i];
        }
    }
    cout << "Unique element: " << unique_num << endl;

    // Скорочений запис: unique_num = unique_num ^ val
    //     Властивості XOR:
    // A⊕A=0 (будь-яке число XOR само із собою дає 0).
    // A⊕0=A (число XOR 0 залишає число без змін).
    for (int val : arr2) {
        unique_num ^= val;
    }

    //     Що треба зробити:
    // Оголосити початкову матрицю (наприклад, розміром 2х3 із будь-якими числами).
    // Створити другу матрицю для результату (розміром 3х2).
    // За допомогою вкладених циклів перенести елементи зі стадої матриці в нову так, щоб result[j][i] = matrix[i][j].
    // Вивести результат у вигляді гарної таблиці в консоль.
    // 1  2  3
    // 4  5  6
    //
    // 1  4
    // 2  5
    // 3  6
    int matrix[2][3] = {
        {1, 2, 3},
        {4, 5, 6}
    };

    for (int i = 0; i < 2; i++) {
        for (int j = 0; j < 3; j++) {
            cout << matrix[i][j] << " ";
        }
        cout << endl;
    }

    int result[3][2] = {};

    for (int i = 0; i < 2; i++) {
        for (int j = 0; j < 3; j++) {
            result[j][i] = matrix[i][j];
        }
    }

    for (const auto& row : result) {                            // row — це посилання на рядок (масив із 2 елементів)
        for (int val : row) {                                               // val — це конкретне число з цього рядка
            std::cout << val << " ";
        }
        std::cout << "\n";
    }

    return 0;
}