//
// Created by Кирило Вєтров on 30.07.2026.
// Завдання 3. Стиснення масиву (std::vector)
//
/* Вимоги:
    - Зчитати N
    - Зчитати N цілих чисел у std::vector<int>.
    - Побудувати новий std::vector<int>, у якому підряд однакові елементи замінені одним.
    - Вивести новий вектор.
    - Додатково вивести кількість елементів, які було видалено під час стиснення.

    -> 1 1 1 2 2 5 5 5 5 3 3 4
*/
#include <iostream>

using namespace std;

int main() {

    cout << "Введіть кількість елементів в масиві: ";
    int N = 1, count = 0;
    cin >> N;
    vector<int> arr(N);
    // Зчитатуємо N цілих чисел у std::vector<int>
    for (int i = 0; i < N; i++) {
        cin >> arr[i];
    }

    // Один з варіантів
    // Проходимо в два цикли, якщо знаходимо однакові видаляємо
    for (int i = 0; i < N; i++) {
        for (int j = i + 1; j < arr.size(); j++) {
            if (arr[i] == arr[j]) {
                arr.erase(arr.begin() + j);
                //arr[j] = 0;
                count++;
                i--;                                                // !!!
            }
        }
    }
    // // Якщо більше двох однакових - не працює
    // for (int i = 0; i < arr.size(); i++) {
    //     if (arr[i] == 0) {
    //         arr.erase(arr.begin() + i);                         // при очищенні зменшується масив на одну позицію
    //         i--;
    //     }
    // }
    // // Вже краще, але довго ...

    cout << '\n' << count << endl;
    for (auto x: arr) {cout << x << '\t';}

    return 0;
}
