//
// Created by Кирило Вєтров on 30.07.2026.
// Завдання 3. Стиснення масиву (std::vector)
//
//  Вимоги:
//     - Зчитати N
//     - Зчитати N цілих чисел у std::vector<int>.
//     - Побудувати новий std::vector<int>, у якому підряд однакові елементи замінені одним.
//     - Вивести новий вектор.
//     - Додатково вивести кількість елементів, які було видалено під час стиснення.
//
//     -> 1 1 1 2 2 5 5 5 5 3 3 4
//
#include <iostream>
#include <unordered_set>                                                // for unordered_set

using namespace std;

int main() {

    cout << "Введіть кількість елементів в масиві: ";
    int N = 1, count = 0;
    cin >> N;
    vector<int> arr(N);
    // Зчитатуємо N цілих чисел у std::vector<int>
    for (int i = 0; i < N; i++) {
        cin >> arr[i];
    }

    // --------------------- Один з варіантів --------------------------
    // Проходимо в два цикли, якщо знаходимо однакові видаляємо
    // for (int i = 0; i < N; i++) {
    //     for (int j = i + 1; j < arr.size(); j++) {
    //         if (arr[i] == arr[j]) {
    //             arr.erase(arr.begin() + j);
    //             //arr[j] = 0;
    //             count++;
    //             i--;                                                 // !!!
    //         }
    //     }
    // }
    // // Якщо більше двох однакових - не працює, то потрібно не забувати вертатись на попередній ел. масиву
    // for (int i = 0; i < arr.size(); i++) {
    //     if (arr[i] == 0) {
    //         arr.erase(arr.begin() + i);                              // при очищенні зменшується масив на одну позицію
    //         i--;
    //     }
    // }
    // // Вже краще, але довго ...
    // =================================================================


    // Другий спосіб. Використовуємо remove_if
    int counter = 0;
    unordered_set<int> unic_arr;                                        // це стандартний контейнер у C++, який
                                                                        // зберігає лише унікальні елементи у довільному порядку
    arr.erase(remove_if(arr.begin(), arr.end(), [&unic_arr, &counter](int x)
    {
        // Якщо елемент вже є, повертаємо true (видаляємо його)
        if (unic_arr.count(x)) {                                        // Лямбда-функція перевіряє: arr.count(x) чи є таке число
            counter++;
            return true;
        }
        else {
            unic_arr.insert(x); // Інакше запам'ятовуємо його і залишаємо
            return false;
        }
    }), arr.end());
    // ** unordered_set автоматично ігнорує дублікати. Якщо спробувати додати елемент,
    // який вже є всередині, нічого не відбудеться.

    // =================================================================

    //cout << '\n' << count << endl;
    cout << '\n' << counter << endl;
    for (auto x: arr) {cout << x << '\t';}

    return 0;
}
