//
// Created by Кирило Вєтров on 12.06.2026.
//
// Завдання 4. Умова: Напишіть цикл while, який одночасно збільшує одну змінну i від 1 до 10
// і зменшує іншу змінну j від 10 до 1.
//
// Використайте оператор "кома" в умові або всередині тіла циклу, щоб керувати обома змінними одночасно.
//
// На кожній ітерації виводьте поточні значення i та j.
#include <iostream>

int main() {
    using namespace std;
    int i{1}, j{10};

    // while (i <= 10 & i >= 1) {
    //     cout << i;
    //     if (i < 10) {
    //         cout << ", ";
    //     }
    //     i++;
    // }
    //
    // cout << endl;
    //
    // while (j <= 10 & j >= 1) {
    //     cout << j;
    //     if (j > 1) {
    //         cout << ", ";
    //     }
    //     j--;
    // }

    while (i <= 10) {
        cout << i << "\t";
        cout << j << endl;
        i++, j--;
    }

    return 0;
}